Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateMiddleStringer Property
 Can't create one or more Middle Stringers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateMiddleStringer { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateMiddleStringer As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateMiddleStringer {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace